Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file
 *  Implements MQTT wrapper APIs to perform MQTT CONNECT, DISCONNET, PUBLISH, SUBSCRIBE, and UNSUBSCRIBE.
 *
 */
#include <string.h>
#include <stdlib.h>
#include "cy_mqtt_api.h"
#include "cyabs_rtos.h"
/******************************************************
 *                      Macros
 ******************************************************/
#ifdef ENABLE_MQTT_LOGS
#define cy_mqtt_log_msg cy_log_msg
#else
#define cy_mqtt_log_msg(a,b,c,...)
#endif

#if defined(ENABLE_MULTICORE_CONN_MW) && defined(USE_VIRTUAL_API)

#include "cy_mqtt_api_internal.h"
#include "cy_vcm_internal.h"
#include "cyhal_ipc.h"

typedef struct mqtt_cb_data_base
{
    cy_mqtt_t            mqtt_handle;
    cy_mqtt_callback_t   mqtt_usr_cb;
    void*                mqtt_usr_data;
} mqtt_cb_data_base_t;

static mqtt_cb_data_base_t  mqtt_handle_cb_database[ CY_MQTT_MAX_HANDLE ]; /* Database to store mapping of mqtt handle and the registered user callback and data for it. */
static int mqtt_handle_index = 0;                                          /* Next available index in the database to store callback info for a handle. */
static cy_mutex_t cb_database_mutex;                                       /* Mutex to provide thread-safe access to the callback databse. */
static bool is_mqtt_virtual_library_initialized = false;                   /* Indicates whether the MQTT library is initialized or not in the secondary core. */


static void virtual_event_handler(void *arg)
{
    cy_rslt_t res;
    cy_mqtt_callback_params_t  *mqtt_event_params;
    cy_mqtt_t mqtt_handle;
    int i = 0;

    mqtt_event_params = (cy_mqtt_callback_params_t *)arg;
    mqtt_handle = mqtt_event_params->mqtt_handle;

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Acquiring Mutex %p \n", cb_database_mutex );
    res = cy_rtos_get_mutex( &cb_database_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
        /* Freeing the memory allocated in local_mqtt_event_cb function in VCM */
        cy_vcm_free((void*)mqtt_event_params->event.data.pub_msg.received_message.payload);
        cy_vcm_free((void*)mqtt_event_params->event.data.pub_msg.received_message.topic);
        return;
    }

    for( i = 0; i < CY_MQTT_MAX_HANDLE; i++ )
    {
        if( mqtt_handle_cb_database[i].mqtt_handle == mqtt_handle )
        {
            cy_mqtt_callback_t evt_cb = mqtt_handle_cb_database[i].mqtt_usr_cb;
            if( evt_cb != NULL )
            {
                evt_cb(mqtt_event_params->mqtt_handle, mqtt_event_params->event, mqtt_handle_cb_database[i].mqtt_usr_data);
                break;
            }
        }
    }

    /* Freeing the memory allocated in local_mqtt_event_cb function in VCM */
    cy_vcm_free((void*)mqtt_event_params->event.data.pub_msg.received_message.payload);
    cy_vcm_free((void*)mqtt_event_params->event.data.pub_msg.received_message.topic);

    res = cy_rtos_set_mutex( &cb_database_mutex );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n virtual_event_handler - Releasing Mutex %p \n", cb_database_mutex );
}

/* This section is virtual-only implementation.
 * The below APIs send the API request to the other core via IPC using the Virtual Connectivity Manager (VCM) library.
 */

cy_rslt_t cy_mqtt_init( void )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    int i = 0;

    if ( is_mqtt_virtual_library_initialized == true )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is already initialized. \n", res );
        return res;
    }

    res = cy_rtos_init_mutex2(&cb_database_mutex, false);
    if ( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Failed to initialize mutex. Res: 0x%x\n", res );
        return res;
    }

    for ( i = 0; i < CY_MQTT_MAX_HANDLE; i++ )
    {
        (void)memset(&mqtt_handle_cb_database[i], 0x00, sizeof(mqtt_cb_data_base_t));
    }

    mqtt_handle_index = 0;
    is_mqtt_virtual_library_initialized = true;

    return res;
}

cy_rslt_t cy_mqtt_get_handle( cy_mqtt_t *mqtt_handle, char *descriptor )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;

