Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_get_handle_params_t params;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_t _handle;

    if( mqtt_handle == NULL || descriptor == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_get_handle()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( strlen(descriptor) > CY_MQTT_DESCP_MAX_LEN )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Descriptor length is greater than maximum permissible length: %u!\n", (uint16_t)CY_MQTT_DESCP_MAX_LEN );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    params.mqtt_handle = &(_handle);
    memcpy( &params.descriptor, descriptor, strlen(descriptor) + 1 );

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_GET_HANDLE;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_get_handle. Res: %u \n", res);
        *mqtt_handle = NULL;
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_get_handle API response is NULL! \n");
        *mqtt_handle = NULL;
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    *mqtt_handle = _handle;
    return *api_res;
}

cy_rslt_t cy_mqtt_register_event_callback( cy_mqtt_t mqtt_handle,
                                           cy_mqtt_callback_t event_callback,
                                           void *user_data )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;
    int i = 0;
    bool handle_found = false;

    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_register_event_callback_params_t params;

    if( mqtt_handle == NULL || event_callback == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_register_event_callback()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n cy_mqtt_register_event_callback - Acquiring Mutex %p \n", cb_database_mutex );
    res = cy_rtos_get_mutex( &cb_database_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
        return res;
    }

    if( mqtt_handle_index == (CY_MQTT_MAX_HANDLE) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nExceeded maximum number of MQTT handles!\n" );
        cy_rtos_set_mutex( &cb_database_mutex );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }

    /*Look for the MQTT handle. If already present, replace the previously registered callback. */
    for( i = 0; i < mqtt_handle_index; i++ )
    {
        if( mqtt_handle_cb_database[i].mqtt_handle == mqtt_handle )
        {
            mqtt_handle_cb_database[i].mqtt_usr_cb = event_callback;
            mqtt_handle_cb_database[i].mqtt_usr_data = user_data;

            handle_found = true;
            break;
        }
    }

    /* If MQTT handle is not found in the callback database, add a new entry for this handle. */
    if( handle_found == false )
    {
        mqtt_handle_cb_database[mqtt_handle_index].mqtt_handle = mqtt_handle;
        mqtt_handle_cb_database[mqtt_handle_index].mqtt_usr_cb = event_callback;
        mqtt_handle_cb_database[mqtt_handle_index].mqtt_usr_data = user_data;

        mqtt_handle_index++;
    }

    res = cy_rtos_set_mutex( &cb_database_mutex );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n cy_mqtt_register_event_callback - Releasing Mutex %p \n", cb_database_mutex );

    if( handle_found == true )
    {
        return CY_RSLT_SUCCESS;
    }

    params.mqtt_handle = mqtt_handle;
    params.event_callback = virtual_event_handler;
    params.user_data = user_data;

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_REG_EVENT_CB;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_register_event_callback. Res: %u \n", res);
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_register_event_callback API response is NULL! \n");
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    return *api_res;
}

cy_rslt_t cy_mqtt_deregister_event_callback( cy_mqtt_t mqtt_handle,
                                             cy_mqtt_callback_t event_callback)
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;
    int i, j;
    bool cb_found = false;

