Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_deregister_event_callback_params_t params;

    if( mqtt_handle == NULL || event_callback == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_deregister_event_callback()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    if( mqtt_handle_index == 0 )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n No callback registered!\n" );
        cy_rtos_set_mutex( &cb_database_mutex );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n cy_mqtt_deregister_event_callback - Acquiring Mutex %p \n", cb_database_mutex );
    res = cy_rtos_get_mutex( &cb_database_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
        return res;
    }

    /*Look for the MQTT handle. */
    for( i = 0; i < mqtt_handle_index; i++ )
    {
        if( mqtt_handle_cb_database[i].mqtt_handle == mqtt_handle && mqtt_handle_cb_database[i].mqtt_usr_cb == event_callback )
        {
            /* If callback is found, move the entries after it by 1 to the left. */
            for( j = i+1; j < mqtt_handle_index; j++ )
            {
                mqtt_handle_cb_database[j-1].mqtt_usr_cb = mqtt_handle_cb_database[j].mqtt_usr_cb;
                mqtt_handle_cb_database[j-1].mqtt_usr_data = mqtt_handle_cb_database[j].mqtt_usr_data;
                mqtt_handle_cb_database[j-1].mqtt_handle = mqtt_handle_cb_database[j].mqtt_handle ;
            }
            /* Set last entry to NULL. */
            mqtt_handle_cb_database[mqtt_handle_index].mqtt_usr_cb = NULL;
            mqtt_handle_cb_database[mqtt_handle_index].mqtt_usr_data = NULL;
            mqtt_handle_cb_database[mqtt_handle_index].mqtt_handle = NULL;

            mqtt_handle_index -= 1;
            cb_found = true;
            break;
        }
    }

    res = cy_rtos_set_mutex( &cb_database_mutex );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", cb_database_mutex, (unsigned int)res );
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n cy_mqtt_register_event_callback - Releasing Mutex %p \n", cb_database_mutex );

    /* If callback is not found in the callback database, return error. */
    if( cb_found == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_deregister_event_callback(). Callback not found for handle: %p!\n", mqtt_handle );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    params.mqtt_handle = mqtt_handle;
    params.event_callback = virtual_event_handler;

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_DEREG_EVENT_CB;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_register_event_callback. Res: %u \n", res);
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_register_event_callback API response is NULL! \n");
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    return *api_res;
}

cy_rslt_t cy_mqtt_publish( cy_mqtt_t mqtt_handle, cy_mqtt_publish_info_t *pubmsg )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;
    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_publish_params_t params;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_publish_info_t _pubmsg;

    if( (mqtt_handle == NULL) || (pubmsg == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_publish()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    memcpy(&(_pubmsg), pubmsg, sizeof(cy_mqtt_publish_info_t));
    params.mqtt_handle = mqtt_handle;
    params.pub_msg = &(_pubmsg);

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_PUBLISH;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_publish. Res: %u \n", res);
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_publish API response is NULL! \n");
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    return *api_res;
}

cy_rslt_t cy_mqtt_subscribe( cy_mqtt_t mqtt_handle, cy_mqtt_subscribe_info_t *sub_info, uint8_t sub_count  )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;
    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_subscribe_params_t params;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_subscribe_info_t _sub_info;

    if( (mqtt_handle == NULL) || (sub_info == NULL) || (sub_count < 1) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_subscribe()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

