Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    memcpy(&(_sub_info), sub_info, sizeof(cy_mqtt_subscribe_info_t));
    params.mqtt_handle = mqtt_handle;
    params.sub_info = &_sub_info;
    params.sub_count = sub_count;

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_SUBSCRIBE;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_subscribe. Res: %u \n", res);
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_subscribe API response is NULL! \n");
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    return *api_res;
}

cy_rslt_t cy_mqtt_unsubscribe( cy_mqtt_t mqtt_handle, cy_mqtt_unsubscribe_info_t *unsub_info, uint8_t unsub_count )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;
    cy_rslt_t *api_res = NULL;
    cy_vcm_request_t api_req;
    cy_vcm_response_t api_resp;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_unsubscribe_params_t params;
    CY_SECTION_SHAREDMEM
    static cy_mqtt_unsubscribe_info_t _unsub_info;

    if( (mqtt_handle == NULL) || (unsub_info == NULL) || (unsub_count < 1) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_unsubscribe()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    memcpy(&(_unsub_info), unsub_info, sizeof(cy_mqtt_unsubscribe_info_t));

    params.mqtt_handle = mqtt_handle;
    params.unsub_info = &(_unsub_info);
    params.unsub_count = unsub_count;

    /* Set API request */
    memset(&api_req, 0, sizeof(cy_vcm_request_t));
    api_req.api_id = CY_VCM_API_MQTT_UNSUBSCRIBE;
    api_req.params = &params;

    /* Send API request */
    res = cy_vcm_send_api_request(&api_req, &api_resp);
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_vcm_send_api_request failed for cy_mqtt_unsubscribe. Res: %u \n", res);
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    /* Get API result */
    api_res = (cy_rslt_t*)(api_resp.result);
    if( api_res == NULL )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : cy_mqtt_unsubscribe API response is NULL! \n");
        return CY_RSLT_MODULE_MQTT_VCM_ERROR;
    }

    return *api_res;
}

cy_rslt_t cy_mqtt_deinit( void )
{
    cy_rslt_t res = CY_RSLT_SUCCESS;

    if ( is_mqtt_virtual_library_initialized == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT library is not initialized on secondary core. Call cy_mqtt_init() first. \n", res );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    res = cy_rtos_deinit_mutex( &cb_database_mutex );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_deinit_mutex failed with Error : [0x%X] \n", (unsigned int)res );
        return res;
    }

    is_mqtt_virtual_library_initialized = false;

    return res;
}

#elif !defined(ENABLE_MULTICORE_CONN_MW) || (defined(ENABLE_MULTICORE_CONN_MW) && !defined(USE_VIRTUAL_API))
/* This section is full-stack implementation. */

#include "cy_utils.h"


/**
 * Timeout for receiving CONNACK packet in milliseconds.
 */
#define CY_MQTT_CONNACK_RECV_TIMEOUT_MS                      ( 2000U )

/**
 * Network socket receive timeout in milliseconds.
 */
#ifdef COMPONENT_CAT5
/* On CAT5 devices(H1-CP), the tick is configured for 10ms,
 * so the smallest unit of time that can be configured is 10ms.
 */
#define CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS                    ( 10U )
#else
#define CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS                    ( 1U )
#endif

/**
 * Timeout in milliseconds for ProcessLoop.
 */
#define CY_MQTT_RECEIVE_DATA_TIMEOUT_MS                      ( 0U )

/**
 * Receive thread sleep time in milliseconds.
 */
#define CY_MQTT_SEC_TO_MSEC_CONVERTOR                         ( 1000 )

#define CY_MQTT_EVENT_THREAD_PRIORITY                        ( CY_RTOS_PRIORITY_NORMAL )

#define CY_MQTT_EVENT_QUEUE_SIZE                             ( 30U )

#define CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC                  ( 500UL )

#define CY_MQTT_MAGIC_HEADER                                 ( 0xbdefacbd )
#define CY_MQTT_MAGIC_FOOTER                                 ( 0xefbcdbfd )

#define CY_MQTT_MAX_EVENT_CALLBACKS                          (2)
/******************************************************
 *                    Constants
 ******************************************************/

/******************************************************
 *                   Enumerations
 ******************************************************/
/**
 * MQTT socket event types.
 */
typedef enum cy_mqtt_socket_event
{
    CY_MQTT_SOCKET_EVENT_DATA_RECEIVE                  = 0, /**< Data receive event from socket */
    CY_MQTT_SOCKET_EVENT_DISCONNECT                    = 1, /**< Disconnection event from socket */
    CY_MQTT_SOCKET_EVENT_PING_REQ                      = 2, /**< MQTT ping timer event */
    CY_MQTT_SOCKET_EVENT_EXIT_THREAD                   = 3  /**< Terminate mqtt_event_processing_thread event from mqtt_deinit */
} cy_mqtt_socket_event_t;

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/**
 * Structure to keep the MQTT PUBLISH packets until an ACK is received
 * for QoS1 and QoS2 publishes.
 */
typedef struct publishpackets
{
    uint16_t               packetid;
    MQTTPublishInfo_t      pubinfo;
} cy_mqtt_pubpack_t;

/**
 * Structure to keep the MQTT PUBLISH packet ACK information
 * for QoS1 and QoS2 publishes.
 */
typedef struct publishpacket_ackstatus
{
    uint16_t      packetid;
    bool          puback_status;
} cy_mqtt_pub_ack_status_t;

