Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*
 * MQTT handle
 */
typedef struct mqtt_object
{
    uint32_t                        mqtt_magic_header;         /**< Magic header to verify the mqtt object */
    bool                            mqtt_secure_mode;          /**< MQTT secured mode. True if secure connection; false otherwise. */
    bool                            mqtt_session_established;  /**< MQTT client session establishment status. */
    bool                            broker_session_present;    /**< Broker session status. */
    bool                            mqtt_conn_status;          /**< MQTT network connect status. */
    uint8_t                         mqtt_obj_index;            /**< MQTT object index in mqtt_handle_database. */
    NetworkContext_t                network_context;           /**< MQTT Network context. */
    MQTTContext_t                   mqtt_context;              /**< MQTT context. */
    cy_awsport_server_info_t        server_info;               /**< MQTT broker info. */
    cy_awsport_ssl_credentials_t    security;                  /**< MQTT secure connection credentials. */
    cy_mqtt_callback_t              mqtt_event_cb[ CY_MQTT_MAX_EVENT_CALLBACKS]; /**< MQTT application callback for events. */
    MQTTSubAckStatus_t              sub_ack_status[ CY_MQTT_MAX_OUTGOING_SUBSCRIBES ]; /**< MQTT SUBSCRIBE command ACK status. */
    uint8_t                         num_of_subs_in_req;        /**< Number of subscription messages in outstanding MQTT subscribe request. */
    bool                            unsub_ack_received;        /**< Status of unsubscribe acknowledgment. */
    cy_mqtt_pub_ack_status_t        pub_ack_status;            /**< MQTT PUBLISH packetack received status. */
    uint16_t                        sent_packet_id;            /**< MQTT packet ID. */
    cy_mqtt_pubpack_t               outgoing_pub_packets[ CY_MQTT_MAX_OUTGOING_PUBLISHES ]; /**< MQTT PUBLISH packet. */
    cy_mutex_t                      process_mutex;             /**< Mutex for synchronizing MQTT object members. */
    cy_timer_t                      mqtt_timer;                /**< RTOS timer to handle the MQTT ping request */
    cy_timer_t                      mqtt_ping_resp_timer;      /**< RTOS timer to handle the MQTT ping response timeout */
    void                            *user_data[ CY_MQTT_MAX_EVENT_CALLBACKS ];                /**< User data which needs to be sent while calling registered app callback. */
    uint16_t                        keepAliveSeconds;          /**< MQTT keep alive timeout in seconds. */
    uint32_t                        mqtt_magic_footer;         /**< Magic footer to verify the mqtt object */
    char                            mqtt_descriptor[ CY_MQTT_DESCP_MAX_LEN + 1 ]; /**< Descriptor used by the application to identify the mqtt handle. */
} cy_mqtt_object_t ;

/*
 * MQTT handle database
 */
typedef struct mqtt_data_base
{
    cy_mqtt_t       *mqtt_handle;
    MQTTContext_t   *mqtt_context;
} mqtt_data_base_t ;

/*
 * Structure to store the socket event and mqtt_obj which will be
 * processed by mqtt_event_processing_thread
 */
typedef struct cy_mqtt_callback_event
{
    cy_mqtt_socket_event_t       socket_event;      /**< Socket event */
    cy_mqtt_object_t             *mqtt_obj;         /**< MQTT Object */
} cy_mqtt_callback_event_t;

/******************************************************
 *               Static Function Declarations
 ******************************************************/

/******************************************************
 *                 Global Variables
 ******************************************************/
static mqtt_data_base_t  mqtt_handle_database[ CY_MQTT_MAX_HANDLE ];
static uint8_t           mqtt_handle_count = 0;
static cy_mutex_t        mqtt_db_mutex;
static bool              mqtt_lib_init_status = false;
static bool              mqtt_db_mutex_init_status = false;
static cy_thread_t       mqtt_event_process_thread = NULL;
static cy_queue_t        mqtt_event_queue;
/******************************************************
 *               Function Definitions
 ******************************************************/
 /* Check validity of the mqtt_obj by verifying mqtt_magic_header and mqtt_magic_footer associated with the object */
static bool is_mqtt_obj_valid( cy_mqtt_object_t *mqtt_obj )
{
    if( (mqtt_obj->mqtt_magic_header == CY_MQTT_MAGIC_HEADER) && (mqtt_obj->mqtt_magic_footer == CY_MQTT_MAGIC_FOOTER) )
    {
        return true;
    }
    return false;
}

/* stop_timer must be protected under mqtt_obj->process_mutex */
static cy_rslt_t stop_timer( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    bool      state = false;

    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to stop_timer \n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }
    if( mqtt_obj->keepAliveSeconds != 0 )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nStopping the timer\n" );
        result = cy_rtos_is_running_timer( &mqtt_obj->mqtt_timer, &state );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_rtos_is_running_timer failed\n" );
            return result;
        }
        if( state == true )
        {
            /* Timer running */
            result = cy_rtos_stop_timer( &mqtt_obj->mqtt_timer );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_rtos_stop_timer failed\n" );
            }
        }
    }
    return result;
}

/* start_timer must be protected under mqtt_obj->process_mutex */
static cy_rslt_t start_timer( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint8_t   retry_count = 0;

    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to start_timer \n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }
    if( mqtt_obj->keepAliveSeconds != 0 )
    {
        do
        {
            result = cy_rtos_start_timer( &mqtt_obj->mqtt_timer, mqtt_obj->keepAliveSeconds * CY_MQTT_SEC_TO_MSEC_CONVERTOR );
            if( result == CY_RSLT_SUCCESS )
            {
                return result;
            }
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_start_timer failed with Error : [0x%X] \n", (unsigned int)result );
            cy_rtos_delay_milliseconds(10);
            retry_count++;
        }
        while( retry_count < CY_MQTT_MAX_RETRY_VALUE );
    }
    return result;
}

