Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*
 * start_mqtt_ping_resp_timer
 *
 * Start reponse timer for mqtt ping response.
 */
static cy_rslt_t start_mqtt_ping_resp_timer( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to start_mqtt_ping_resp_timer \n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    result = cy_rtos_start_timer( &mqtt_obj->mqtt_ping_resp_timer, MQTT_PINGRESP_TIMEOUT_MS );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR,
                "\nMqtt ping resp timer start failed with Error : [0x%X] \n", (unsigned int)result );
    }
    return result;
}

/*
 * stop_mqtt_ping_resp_timer
 *
 * Stop mqtt ping reponse timer.
 */
static cy_rslt_t stop_mqtt_ping_resp_timer( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    bool      state = false;

    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to stop_mqtt_ping_resp_timer \n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }
    /* stop response timer */
    result = cy_rtos_is_running_timer( &mqtt_obj->mqtt_ping_resp_timer, &state );
    if( result == CY_RSLT_SUCCESS && state == true )
    {
        result = cy_rtos_stop_timer( &mqtt_obj->mqtt_ping_resp_timer );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPing response timer stop failed\n" );
        }
    }
    return result;
}

/*
 * mqtt_pingresp_timeout_callback
 *
 * Callback if no ping response received in time.
 */
static void mqtt_pingresp_timeout_callback( void *arg )
{
    cy_rslt_t                res = CY_RSLT_SUCCESS;
    cy_mqtt_callback_event_t event;
    cy_mqtt_object_t         *mqtt_obj = NULL;

    if( arg == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO,
                "\nInvalid handle to mqtt_awsport_network_receive_callback, so nothing to do..!\n" );
        return;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO,
                    "\nMQTT Keepalive Timeout\n" );

    mqtt_obj = ( cy_mqtt_object_t * )arg;

    /* Queue Disconnect event */
    event.socket_event = CY_MQTT_SOCKET_EVENT_DISCONNECT;
    event.mqtt_obj = mqtt_obj;

    res = cy_rtos_put_queue( &mqtt_event_queue, (void *)&event, CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC, false );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nPushing to MQTT event to mqtt_event_queue failed with Error : [0x%X] \n",
                        (unsigned int)res );
    }
    return;
}

static void mqtt_ping_request_callback( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t                  result = CY_RSLT_SUCCESS;
    cy_mqtt_callback_event_t   event;

    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to mqtt_ping_request_callback \n" );
        return;
    }

    event.socket_event = CY_MQTT_SOCKET_EVENT_PING_REQ;
    event.mqtt_obj = mqtt_obj;

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPushing mqtt_ping_request event to the mqtt_event_queue. \n" );

    result = cy_rtos_put_queue( &mqtt_event_queue, (void *)&event, CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC, false );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nPushing mqtt_ping_request event to the mqtt_event_queue failed with Error : [0x%X] \n", (unsigned int)result );
    }
    return;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_cleanup_outgoing_publish( cy_mqtt_object_t *mqtt_obj, uint8_t index )
{
    if( index >= CY_MQTT_MAX_OUTGOING_PUBLISHES )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to mqtt_cleanup_outgoing_publish.\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }
    /* Clear the outgoing PUBLISH packet. */
    ( void ) memset( &( mqtt_obj->outgoing_pub_packets[ index ] ), 0x00, sizeof( mqtt_obj->outgoing_pub_packets[ index ] ) );
    return CY_RSLT_SUCCESS;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_cleanup_outgoing_publish_with_packet_id( cy_mqtt_object_t *mqtt_obj, uint16_t packetid )
{
    cy_rslt_t  result = CY_RSLT_SUCCESS;
    uint8_t    index;

    if( (mqtt_obj == NULL) || (packetid == MQTT_PACKET_ID_INVALID) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to mqtt_cleanup_outgoing_publish_with_packet_id.\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    /* Clean up all saved outgoing PUBLISH packets. */
    for( index = 0; index < CY_MQTT_MAX_OUTGOING_PUBLISHES; index++ )
    {
        if( mqtt_obj->outgoing_pub_packets[ index ].packetid == packetid )
        {
            result = mqtt_cleanup_outgoing_publish( mqtt_obj, index );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_cleanup_outgoing_publish failed with Error : [0x%X] \n", (unsigned int)result );
                break;
            }
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nCleaned up outgoing PUBLISH packet with packet id %u.\n", packetid );
            break;
        }
    }
    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_update_suback_status( cy_mqtt_object_t *mqtt_obj, MQTTPacketInfo_t *packet_info )
{
    uint8_t        *payload = NULL, i = 0;
    size_t         num_of_subscriptions = 0;
    MQTTStatus_t   mqttStatus = MQTTSuccess;

    mqttStatus = MQTT_GetSubAckStatusCodes( packet_info, &payload, &num_of_subscriptions );
    if( (mqttStatus != MQTTSuccess) || (num_of_subscriptions != mqtt_obj->num_of_subs_in_req) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT_GetSubAckStatusCodes failed with status = %s.\n", MQTT_Status_strerror( mqttStatus ) );
        /* SubAckStatusCodes are not available for outstanding subscription messages waiting for acknowledgment. So Setting num_of_subs_in_req to 0.*/
        mqtt_obj->num_of_subs_in_req = 0;
        return CY_RSLT_MODULE_MQTT_ERROR;
    }
    ( void ) mqttStatus;

    for( i = 0; i < mqtt_obj->num_of_subs_in_req; i++ )
    {
        mqtt_obj->sub_ack_status[i] = (MQTTSubAckStatus_t)payload[ i ];
    }
    /* All outstanding subscription message acknowledgment status is updated. So Setting num_of_subs_in_req to 0. */
    mqtt_obj->num_of_subs_in_req = 0;
    return CY_RSLT_SUCCESS;
}

