Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_get_next_free_index_for_publish( cy_mqtt_object_t *mqtt_obj, uint8_t *pindex )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint8_t   index  = 0;

    if( (mqtt_obj == NULL) || (pindex == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to mqtt_get_next_free_index_for_publish.\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_get_next_free_index_for_publish - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        return result;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_get_next_free_index_for_publish - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    for( index = 0; index < CY_MQTT_MAX_OUTGOING_PUBLISHES; index++ )
    {
        /* A free index is marked by the invalid packet ID.
         * Check if the the index has a free slot. */
        if( mqtt_obj->outgoing_pub_packets[ index ].packetid == MQTT_PACKET_ID_INVALID )
        {
            result = CY_RSLT_SUCCESS;
            mqtt_obj->outgoing_pub_packets[ index ].packetid = MQTT_GetPacketId( &(mqtt_obj->mqtt_context) );
            *pindex = index;
            break;
        }
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_get_next_free_index_for_publish - Releasing Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );

        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_get_next_free_index_for_publish - Released Mutex %p \n", mqtt_obj->process_mutex );

    if( index >= CY_MQTT_MAX_OUTGOING_PUBLISHES )
    {
        result = CY_RSLT_MODULE_MQTT_ERROR;
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_cleanup_outgoing_publishes( cy_mqtt_object_t *mqtt_obj )
{
    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to mqtt_cleanup_outgoing_publishes.\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    /* Clean up all outgoing PUBLISH packets. */
    ( void ) memset( mqtt_obj->outgoing_pub_packets, 0x00, sizeof( mqtt_obj->outgoing_pub_packets ) );
    return CY_RSLT_SUCCESS;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_handle_publish_resend( cy_mqtt_object_t *mqtt_obj )
{
    cy_rslt_t         result = CY_RSLT_SUCCESS;
    MQTTStatus_t      mqttStatus = MQTTSuccess;
    uint8_t           index = 0U;
    MQTTStateCursor_t cursor = MQTT_STATE_CURSOR_INITIALIZER;
    uint16_t          packetid_to_resend = MQTT_PACKET_ID_INVALID;
    bool              found_packetid = false;

    /* MQTT_PublishToResend() provides a packet ID of the next PUBLISH packet
     * that should be resent. In accordance with the MQTT v3.1.1 spec,
     * MQTT_PublishToResend() preserves the ordering of when the original
     * PUBLISH packets were sent. The outgoing_pub_packets array is searched
     * through for the associated packet ID. */
    packetid_to_resend = MQTT_PublishToResend( &(mqtt_obj->mqtt_context), &cursor );
    while( packetid_to_resend != MQTT_PACKET_ID_INVALID )
    {
        found_packetid = false;

        for( index = 0U; index < CY_MQTT_MAX_OUTGOING_PUBLISHES; index++ )
        {
            if( mqtt_obj->outgoing_pub_packets[ index ].packetid == packetid_to_resend )
            {
                found_packetid = true;
                if( mqtt_obj->outgoing_pub_packets[ index ].pubinfo.qos != MQTTQoS0 )
                {
                    mqtt_obj->outgoing_pub_packets[ index ].pubinfo.dup = true;

                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSending duplicate PUBLISH with packet id %u.\n",
                                     mqtt_obj->outgoing_pub_packets[ index ].packetid );
                    mqttStatus = MQTT_Publish( &(mqtt_obj->mqtt_context), &(mqtt_obj->outgoing_pub_packets[ index ].pubinfo),
                                               mqtt_obj->outgoing_pub_packets[ index ].packetid );
                    if( mqttStatus != MQTTSuccess )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSending duplicate PUBLISH for packet id %u failed with status %s.\n",
                                         mqtt_obj->outgoing_pub_packets[ index ].packetid, MQTT_Status_strerror( mqttStatus ) );
                        result = CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
                        break;
                    }
                    else
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSent duplicate PUBLISH successfully for packet id %u.\n\n",
                                         mqtt_obj->outgoing_pub_packets[ index ].packetid );
                    }
                }
                else
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nResending PUBLISH packet id %u. is not required as its having QoS0\n\n",
                                     mqtt_obj->outgoing_pub_packets[ index ].packetid );
                }

            }
        }

        if( found_packetid == false )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nPacket id %u requires resend, but was not found in outgoing_pub_packets.\n",
                             packetid_to_resend );
            result = CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
            break;
        }
        else
        {
            /* Get the next packetID to be resent. */
            packetid_to_resend = MQTT_PublishToResend( &(mqtt_obj->mqtt_context), &cursor );
        }
    }

    return result;
}

