Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*----------------------------------------------------------------------------------------------------------*/

static void mqtt_awsport_network_disconnect_callback( void *arg )
{
    cy_rslt_t                result = CY_RSLT_SUCCESS;
    cy_mqtt_callback_event_t event;
    cy_mqtt_object_t         *mqtt_obj = NULL;

    if( arg == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid argument for mqtt_awsport_network_disconnect_callback, so nothing to do..!\n" );
        return;
    }

    mqtt_obj = ( cy_mqtt_object_t * )arg;

    event.socket_event = CY_MQTT_SOCKET_EVENT_DISCONNECT;
    event.mqtt_obj = mqtt_obj;

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\n Network disconnection notification from socket layer.\n" );

    result = cy_rtos_put_queue( &mqtt_event_queue, (void *)&event, CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC, false );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nPushing disconnect event to the mqtt_event_queue failed with Error : [0x%X] \n", (unsigned int)result );
    }

    return;
}

/*----------------------------------------------------------------------------------------------------------*/

static void call_registered_event_callbacks(cy_mqtt_t handle, cy_mqtt_event_t event)
{
    int i = 0;
    cy_mqtt_object_t *mqtt_obj = ( cy_mqtt_object_t * )handle;
    cy_mqtt_callback_t event_cb;

    for ( i = 0; i < CY_MQTT_MAX_EVENT_CALLBACKS; i++ )
    {
        if( mqtt_obj->mqtt_event_cb[i] != NULL )
        {
            event_cb = mqtt_obj->mqtt_event_cb[i];
            event_cb( handle, event, mqtt_obj->user_data[i] );
        }
    }
}

static void mqtt_event_callback( MQTTContext_t *param_mqtt_context,
                                 MQTTPacketInfo_t *param_packet_info,
                                 MQTTDeserializedInfo_t *param_deserialized_info )
{
    cy_rslt_t         result = CY_RSLT_SUCCESS;
    uint16_t          packet_id;
    cy_mqtt_object_t  *mqtt_obj = NULL;
    cy_mqtt_t         handle = NULL;
    uint8_t           index = 0;
    cy_mqtt_event_t   event;

    if( (param_mqtt_context == NULL) || (param_packet_info == NULL) || (param_deserialized_info == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to mqtt_event_callback.\n" );
        return;
    }

    memset( &event, 0x00, sizeof(cy_mqtt_event_t) );

    for( index = 0;index < CY_MQTT_MAX_HANDLE;index++ )
    {
        if( mqtt_handle_database[index].mqtt_context ==  param_mqtt_context )
        {
            handle = mqtt_handle_database[index].mqtt_handle;
            break;
        }
    }

    if( handle == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Invalid MQTT Context..\n" );
        return;
    }

    mqtt_obj = ( cy_mqtt_object_t * )handle;
    packet_id = param_deserialized_info->packetIdentifier;

    /* Handle incoming PUBLISH packets. The lower 4 bits of the PUBLISH packet
     * type is used for the dup, QoS, and retain flags. Therefore, masking
     * out the lower bits to check whether the packet is a PUBLISH packet. */
    if( ( param_packet_info->type & 0xF0U ) == MQTT_PACKET_TYPE_PUBLISH )
    {
        if( param_deserialized_info->pPublishInfo != NULL )
        {
            /* Handle incoming PUBLISH packets. */
            event.type = CY_MQTT_EVENT_TYPE_PUBLISH_RECEIVE;
            event.data.pub_msg.packet_id = packet_id;
            event.data.pub_msg.received_message.dup =  param_deserialized_info->pPublishInfo->dup;
            event.data.pub_msg.received_message.payload = (const char *) (param_deserialized_info->pPublishInfo->pPayload);
            event.data.pub_msg.received_message.payload_len = param_deserialized_info->pPublishInfo->payloadLength;

            if( param_deserialized_info->pPublishInfo->qos == MQTTQoS0 )
            {
                event.data.pub_msg.received_message.qos = CY_MQTT_QOS0;
            }
            else if( param_deserialized_info->pPublishInfo->qos == MQTTQoS1 )
            {
                event.data.pub_msg.received_message.qos = CY_MQTT_QOS1;
            }
            else
            {
                event.data.pub_msg.received_message.qos = CY_MQTT_QOS2;
            }
            event.data.pub_msg.received_message.retain = param_deserialized_info->pPublishInfo->retain;
            event.data.pub_msg.received_message.topic = param_deserialized_info->pPublishInfo->pTopicName;
            event.data.pub_msg.received_message.topic_len = param_deserialized_info->pPublishInfo->topicNameLength;

            call_registered_event_callbacks(handle, event);
        }
        else
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Invalid pPublishInfo..\n" );
            return;
        }
    }
    else
    {
        /* Handle other packets. */
        switch( param_packet_info->type )
        {
            case MQTT_PACKET_TYPE_SUBACK:

                /* Make sure that the ACK packet identifier matches with the Request packet identifier. */
                if( mqtt_obj->sent_packet_id != packet_id )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nSUBACK packet identifier does not matches with Request packet identifier.\n" );
                }
                else
                {
                    /* A SUBACK from the broker, containing the server response to our subscription request, has been received.
                     * It contains the status code indicating server approval/rejection for the subscription to the single topic
                     * requested. The SUBACK will be parsed to obtain the status code; this status code will be stored in the MQTT object
                     * member 'sub_ack_status'. */
                    result = mqtt_update_suback_status( mqtt_obj, param_packet_info );
                    if( result != CY_RSLT_SUCCESS )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n mqtt_update_suback_status failed..!\n" );
                    }
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSUBACK packet identifier matches with Request packet identifier.\n" );
                }
                break;

            case MQTT_PACKET_TYPE_UNSUBACK:
                /* Make sure that the UNSUBACK packet identifier matches with the Request packet identifier. */
                if( mqtt_obj->sent_packet_id != packet_id )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nUNSUBACK packet identifier does not matches with Request packet identifier.\n" );
                    mqtt_obj->unsub_ack_received = false;
                }
                else
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nUNSUBACK packet identifier matches with Request packet identifier.\n" );
                    mqtt_obj->unsub_ack_received = true;
                }
                break;

