Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
            case MQTT_PACKET_TYPE_PINGRESP:
                if( param_deserialized_info->deserializationResult != MQTTSuccess )
                {
                    memset( &event, 0x00, sizeof(cy_mqtt_event_t) );
                    event.type = CY_MQTT_EVENT_TYPE_DISCONNECT;
                    event.data.reason = CY_MQTT_DISCONN_TYPE_BROKER_DOWN;

                    call_registered_event_callbacks(handle, event);

                    mqtt_obj->mqtt_session_established = false;
                }
                else
                {
                    /* stop response timer */
                    stop_mqtt_ping_resp_timer(mqtt_obj);
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPing response received.\n" );
                break;

            case MQTT_PACKET_TYPE_PUBREC:
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPUBREC received for packet id %u.\n\n", packet_id );
                if( param_deserialized_info->deserializationResult != MQTTSuccess )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nPUBREC received with status %s.\n", MQTT_Status_strerror( param_deserialized_info->deserializationResult ) );
                }
                else
                {
                    if( packet_id == mqtt_obj->pub_ack_status.packetid )
                    {
                        mqtt_obj->pub_ack_status.puback_status = true;
                    }
                    else
                    {
                        mqtt_obj->pub_ack_status.puback_status = false;
                    }
                }
                /* Clean up the PUBLISH packet when a PUBREC is received. */
                (void)mqtt_cleanup_outgoing_publish_with_packet_id( mqtt_obj, packet_id );
                break;

            case MQTT_PACKET_TYPE_PUBREL:
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPUBREL received for packet id %u.\n", packet_id );
                break;

            case MQTT_PACKET_TYPE_PUBCOMP:
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPUBCOMP received for packet id %u.\n\n", packet_id );
                break;

            case MQTT_PACKET_TYPE_PUBACK:
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPUBACK received for packet id %u.\n\n", packet_id );
                if( param_deserialized_info->deserializationResult != MQTTSuccess )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nPUBACK received with status %s.\n", MQTT_Status_strerror( param_deserialized_info->deserializationResult ) );
                }
                else
                {
                    if( packet_id == mqtt_obj->pub_ack_status.packetid )
                    {
                        mqtt_obj->pub_ack_status.puback_status = true;
                    }
                    else
                    {
                        mqtt_obj->pub_ack_status.puback_status = false;
                    }
                }
                /* Clean up the PUBLISH packet when a PUBACK is received. */
                (void)mqtt_cleanup_outgoing_publish_with_packet_id( mqtt_obj, packet_id );
                break;

            case MQTT_PACKET_TYPE_DISCONNECT:
                /* Because this is user-initiated disconnection, no need to notify the application.*/
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nDisconnect packet received:(%02x).\n\n", param_packet_info->type );
                break;

            /* Any other packet type is invalid. */
            default:
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nUnknown packet type received:(%02x).\n\n", param_packet_info->type );
        }
    }
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_establish_session( cy_mqtt_object_t *mqtt_obj,
                                         MQTTConnectInfo_t *connect_info,
                                         MQTTPublishInfo_t *will_msg,
                                         bool create_clean_session,
                                         bool *session_present )
{
    cy_rslt_t         result = CY_RSLT_SUCCESS;
    MQTTStatus_t      mqttStatus = MQTTSuccess;

    /* Establish an MQTT session by sending a CONNECT packet. */

    /* Send an MQTT CONNECT packet to the broker. */
    mqttStatus = MQTT_Connect( &(mqtt_obj->mqtt_context), connect_info, will_msg, CY_MQTT_CONNACK_RECV_TIMEOUT_MS, session_present );
    if( mqttStatus != MQTTSuccess )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nConnection with MQTT broker failed with status %s.\n", MQTT_Status_strerror( mqttStatus ) );
        return CY_RSLT_MODULE_MQTT_CONNECT_FAIL;
    }
    else
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nMQTT connection successfully established with broker.\n\n" );
        mqtt_obj->mqtt_session_established = true;
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/
int32_t mqtt_awsport_network_receive( NetworkContext_t *network_context, void *buffer, size_t bytes_recv )
{
    int32_t bytes_received = 0, total_received = 0;
    size_t entryTimeMs = 0U, exitTimeMs = 0, remainingTimeMs = 0, elapsedTimeMs = 0U;;
    size_t bytestoread = 0;

    remainingTimeMs = CY_MQTT_MESSAGE_RECEIVE_TIMEOUT_MS;

    do
    {
        bytestoread = (size_t)bytes_recv - total_received;
        entryTimeMs = Clock_GetTimeMs();
        bytes_received = cy_awsport_network_receive( network_context, (void *)((char *)buffer + total_received), bytestoread );
        exitTimeMs = Clock_GetTimeMs();
        elapsedTimeMs = exitTimeMs - entryTimeMs;
        if( bytes_received < 0 )
        {
            return bytes_received;
        }
        else if( bytes_received == 0 )
        {
            if( total_received == 0 )
            {
                /* No data in the socket, so return. */
                break;
            }
        }
        else
        {
            total_received = total_received + bytes_received;
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n Total Bytes Received = %u\n", (unsigned int)total_received );
            /* Reset the wait time as some data is received. */
            elapsedTimeMs = 0;
            remainingTimeMs = CY_MQTT_MESSAGE_RECEIVE_TIMEOUT_MS;
        }
        remainingTimeMs = remainingTimeMs - elapsedTimeMs;
    } while( (total_received < bytes_recv) && (remainingTimeMs > 0) );

