Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    return total_received;
}

/*----------------------------------------------------------------------------------------------------------*/

static cy_rslt_t mqtt_initialize_core_lib( MQTTContext_t *param_mqtt_context,
                                           NetworkContext_t *param_network_context,
                                           uint8_t *networkbuff, uint32_t buff_len )
{
    cy_rslt_t            result = CY_RSLT_SUCCESS;
    MQTTStatus_t         mqttStatus = MQTTSuccess;
    MQTTFixedBuffer_t    networkBuffer;
    TransportInterface_t transport;

    if( (param_mqtt_context == NULL) || (param_network_context == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Bad arguments to mqtt_initialize_core_lib.\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    memset( &networkBuffer, 0x00, sizeof(MQTTFixedBuffer_t) );
    memset( &transport, 0x00, sizeof(TransportInterface_t) );

    /* Fill in TransportInterface send and receive function pointers. */
    transport.pNetworkContext = param_network_context;
    transport.send = (TransportSend_t)&cy_awsport_network_send;
    transport.recv = (TransportRecv_t)&mqtt_awsport_network_receive;

    /* Fill the values for the network buffer. */
    networkBuffer.pBuffer = networkbuff;
    networkBuffer.size = buff_len;

    /* Initialize the MQTT library. */
    mqttStatus = MQTT_Init( param_mqtt_context, &transport, Clock_GetTimeMs,
                            mqtt_event_callback, &networkBuffer );
    if( mqttStatus != MQTTSuccess )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT init failed with Status = %s.\n", MQTT_Status_strerror( mqttStatus ) );
        result = CY_RSLT_MODULE_MQTT_INIT_FAIL;
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

static void mqtt_event_processing_thread( cy_thread_arg_t arg )
{
    cy_rslt_t                  result = CY_RSLT_SUCCESS;
    cy_mqtt_object_t           *mqtt_obj = NULL;
    cy_mqtt_event_t            event;
    cy_mqtt_callback_event_t   socket_event;
    MQTTStatus_t               mqtt_status = MQTTSuccess;
    bool                       connect_status = true;
    bool                       mqtt_ping_resp_wait;
   (void)arg;
    int                        index = 0;

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nStarting mqtt_event_processing_thread...\n" );

    while( true )
    {
        memset( &socket_event, 0x00, sizeof( cy_mqtt_callback_event_t ) );
        result = cy_rtos_get_queue( &mqtt_event_queue, (void *)&socket_event, CY_RTOS_NEVER_TIMEOUT, false );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_queue failed with Error :[0x%X]\n", (unsigned int)result );
            continue;
        }

        if( socket_event.socket_event == CY_MQTT_SOCKET_EVENT_EXIT_THREAD )
        {
            break;
        }

        memset( &event, 0x00, sizeof( cy_mqtt_event_t ) );
        if( socket_event.mqtt_obj == NULL )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid mqtt handle...!\n" );
            continue;
        }

        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquiring Mutex %p \n", mqtt_db_mutex );
        result = cy_rtos_get_mutex( &mqtt_db_mutex, CY_RTOS_NEVER_TIMEOUT );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
            continue;
        }

        /* Check if the mqtt_obj is still present in mqtt_handle_database  */
        for( index = 0;index < CY_MQTT_MAX_HANDLE;index++ )
        {
            if( mqtt_handle_database[index].mqtt_handle == (void *)socket_event.mqtt_obj )
            {
                /* The mqtt_obj is present in mqtt_handle_database */
                break;
            }
        }
        if( index == CY_MQTT_MAX_HANDLE )
        {
            /* The mqtt_obj is no longer available. Hence do not process the events related to this object */
            result = cy_rtos_set_mutex( &mqtt_db_mutex );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
            }
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_db_mutex );
            continue;
        }

        switch (socket_event.socket_event)
        {
            case CY_MQTT_SOCKET_EVENT_DATA_RECEIVE:
            {
                mqtt_obj = (cy_mqtt_object_t *)socket_event.mqtt_obj;
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
                    result = cy_rtos_set_mutex( &mqtt_db_mutex );
                    if( result != CY_RSLT_SUCCESS )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
                    }
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_db_mutex );
                    continue;
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquired Mutex %p \n", mqtt_obj->process_mutex );
                /* Stop MQTT Ping Timer */
                result = stop_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstop_timer failed\n" );
                }

