Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
                connect_status = mqtt_obj->mqtt_session_established;
                if( connect_status )
                {
                    mqtt_ping_resp_wait = mqtt_obj->mqtt_context.waitingForPingResp;
                    mqtt_status = MQTT_ProcessLoop( &(mqtt_obj->mqtt_context), CY_MQTT_RECEIVE_DATA_TIMEOUT_MS );
                    if( mqtt_status != MQTTSuccess )
                    {
                        if( (mqtt_status == MQTTRecvFailed)  || (mqtt_status == MQTTSendFailed) ||
                            (mqtt_status == MQTTBadResponse) || (mqtt_status == MQTTKeepAliveTimeout) ||
                            (mqtt_status == MQTTIllegalState ) )
                        {
                            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nmqtt_event_processing_thread MQTT_ProcessLoop failed with status %s \n", MQTT_Status_strerror(mqtt_status) );
                            memset( &event, 0x00, sizeof(cy_mqtt_event_t) );
                            event.type = CY_MQTT_EVENT_TYPE_DISCONNECT;

                            if( mqtt_status == MQTTKeepAliveTimeout )
                            {
                                event.data.reason = CY_MQTT_DISCONN_TYPE_BROKER_DOWN;
                            }
                            else if( (mqtt_status == MQTTRecvFailed) || (mqtt_status == MQTTSendFailed) )
                            {
                                event.data.reason = CY_MQTT_DISCONN_TYPE_SND_RCV_FAIL;
                            }
                            else
                            {
                                event.data.reason = CY_MQTT_DISCONN_TYPE_BAD_RESPONSE;
                            }

                            /* Call registered application callbacks */
                            call_registered_event_callbacks((cy_mqtt_t)mqtt_obj, event);

                            mqtt_obj->mqtt_session_established = false;
                        }
                    }
                    else
                    {
                        if( ( mqtt_ping_resp_wait == true ) && ( mqtt_obj->mqtt_context.waitingForPingResp == false ) )
                        {
                            /* we have received the mqtt response. Stop timer */
                            stop_mqtt_ping_resp_timer( mqtt_obj );
                        }
                    }
                }

                /* Start MQTT Ping Timer */
                result = start_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed\n" );
                }

                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Releasing Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_obj->process_mutex );

                break;
            }

            case CY_MQTT_SOCKET_EVENT_DISCONNECT:
            {
                mqtt_obj = (cy_mqtt_object_t *)socket_event.mqtt_obj;
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
                    result = cy_rtos_set_mutex( &mqtt_db_mutex );
                    if( result != CY_RSLT_SUCCESS )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
                    }
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_db_mutex );
                    continue;
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquired Mutex %p \n", mqtt_obj->process_mutex );

                /* Stop MQTT Ping Timer */
                result = stop_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstop_timer failed\n" );
                }
                result = stop_mqtt_ping_resp_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstop mqtt ping resp timer failed\n" );
                }

                /* Reset keepAliveSeconds to 0 to avoid timer activity after disconnection */
                mqtt_obj->keepAliveSeconds = 0;
                event.type = CY_MQTT_EVENT_TYPE_DISCONNECT;

                if( mqtt_obj->mqtt_session_established == true )
                {
                    event.data.reason = CY_MQTT_DISCONN_TYPE_NETWORK_DOWN;

                    call_registered_event_callbacks((cy_mqtt_t)mqtt_obj, event);

                    mqtt_obj->mqtt_session_established = false;
                }

                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Releasing Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_obj->process_mutex );

                break;
            }

            case CY_MQTT_SOCKET_EVENT_PING_REQ:
            {
                mqtt_obj = (cy_mqtt_object_t *)socket_event.mqtt_obj;
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
                    result = cy_rtos_set_mutex( &mqtt_db_mutex );
                    if( result != CY_RSLT_SUCCESS )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
                    }
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_db_mutex );
                    continue;
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Acquired Mutex %p \n", mqtt_obj->process_mutex );
                /* Stop MQTT Ping Timer */
                result = stop_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstop_timer failed\n" );
                }

