Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
                connect_status = mqtt_obj->mqtt_session_established;
                if( connect_status )
                {
                    mqtt_status = MQTT_Ping( &(mqtt_obj->mqtt_context) );
                    if( mqtt_status != MQTTSuccess )
                    {
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT_Ping failed with Error : [0x%X] ", (unsigned int)mqtt_status );
                        if( mqtt_obj->mqtt_session_established == true )
                        {
                            event.data.reason = CY_MQTT_DISCONN_TYPE_NETWORK_DOWN;

                            call_registered_event_callbacks((cy_mqtt_t)mqtt_obj, event);

                            mqtt_obj->mqtt_session_established = false;
                        }
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Releasing Mutex %p ", mqtt_obj->process_mutex );
                        result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
                        if( result != CY_RSLT_SUCCESS )
                        {
                            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] ", (unsigned int)result );
                        }
                        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p ", mqtt_obj->process_mutex );

                        break;
                    }
                    else
                    {
                        /* Start ping response timer */
                        start_mqtt_ping_resp_timer(mqtt_obj);
                    }
                }
                /* Start MQTT Ping Timer */
                result = start_timer( mqtt_obj );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed\n" );
                }

                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Releasing Mutex %p \n", mqtt_obj->process_mutex );
                result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
                if( result != CY_RSLT_SUCCESS )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
                }
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_obj->process_mutex );

                break;
            }
            default:
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid event type \n" );
                break;
            }
        }
        result = cy_rtos_set_mutex( &mqtt_db_mutex );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        }
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_event_processing_thread - Released Mutex %p \n", mqtt_db_mutex );
    }
    result = cy_rtos_exit_thread();
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_exit_thread failed with Error :[0x%X]\n", (unsigned int)result );
    }
}

/*----------------------------------------------------------------------------------------------------------*/
static void mqtt_awsport_network_receive_callback( void *arg )
{
    cy_rslt_t                res = CY_RSLT_SUCCESS;
    cy_mqtt_callback_event_t event;
    cy_mqtt_object_t         *mqtt_obj = NULL;

    if( arg == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nInvalid handle to mqtt_awsport_network_receive_callback, so nothing to do..!\n" );
        return;
    }

    mqtt_obj = ( cy_mqtt_object_t * )arg;

    event.socket_event = CY_MQTT_SOCKET_EVENT_DATA_RECEIVE;
    event.mqtt_obj = mqtt_obj;

    res = cy_rtos_put_queue( &mqtt_event_queue, (void *)&event, CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC, false );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nPushing to MQTT event to mqtt_event_queue failed with Error : [0x%X] \n", (unsigned int)res );
    }
    return;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_init( void )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if( mqtt_lib_init_status == true )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nMQTT library is already initialized. Number of MQTT client instance : [%d] \n", mqtt_handle_count );
        return result;
    }

    result = cy_rtos_init_mutex2( &mqtt_db_mutex, false );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nCreating new mutex %p. failed\n", mqtt_db_mutex );
        return result;
    }
    mqtt_db_mutex_init_status = true;

    result = cy_awsport_network_init();
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_init failed with Error : [0x%X] \n", (unsigned int)result );
        (void)cy_rtos_deinit_mutex( &mqtt_db_mutex );
        mqtt_db_mutex_init_status = false;
        return result;
    }

    /*
     * Initialize the queue for mqtt events.
     */
    result = cy_rtos_init_queue( &mqtt_event_queue, CY_MQTT_EVENT_QUEUE_SIZE, sizeof(cy_mqtt_callback_event_t) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_init_queue failed with Error : [0x%X] \n", (unsigned int)result );
        (void)cy_rtos_deinit_mutex( &mqtt_db_mutex );
        (void)cy_awsport_network_deinit();
        mqtt_db_mutex_init_status = false;
        return result;
    }

    result = cy_rtos_create_thread( &mqtt_event_process_thread, mqtt_event_processing_thread, "MQTTEventProcessingThread", NULL,
                                    CY_MQTT_EVENT_THREAD_STACK_SIZE, CY_MQTT_EVENT_THREAD_PRIORITY, 0 );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_create_thread failed with Error : [0x%X] \n", (unsigned int)result );
        (void)cy_rtos_deinit_mutex( &mqtt_db_mutex );
        (void)cy_awsport_network_deinit();
        (void)cy_rtos_deinit_queue( &mqtt_event_queue );
        mqtt_db_mutex_init_status = false;
        return result;
    }

    mqtt_lib_init_status = true;
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_awsport_network_init successful.\n" );

    return result;
}

