Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_create( uint8_t *buffer, uint32_t bufflen,
                          cy_awsport_ssl_credentials_t *security,
                          cy_mqtt_broker_info_t *broker_info,
                          char *descriptor,
                          cy_mqtt_t *mqtt_handle )
{
    cy_rslt_t         result = CY_RSLT_SUCCESS;
    cy_mqtt_object_t  *mqtt_obj = NULL;
    uint8_t           slot_index;
    bool              slot_found;
    bool              process_mutex_init_status = false;
    cy_mqtt_t         handle;

    if( (broker_info == NULL) || (mqtt_handle == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_create()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( buffer == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid network buffer..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( bufflen < CY_MQTT_MIN_NETWORK_BUFFER_SIZE )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBuffer length is less then minimun network buffer size : %u..!\n", (uint16_t)CY_MQTT_MIN_NETWORK_BUFFER_SIZE );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( descriptor == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid descriptor..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( strlen(descriptor) > CY_MQTT_DESCP_MAX_LEN )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Descriptor length is greater than maximum permissible length: %u!\n", (uint16_t)CY_MQTT_DESCP_MAX_LEN );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    result = cy_rtos_get_mutex( &mqtt_db_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_create - Acquired Mutex %p \n", mqtt_db_mutex );

    if( mqtt_handle_count >= CY_MQTT_MAX_HANDLE )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nNumber of created mqtt object exceeds %d..!\n", CY_MQTT_MAX_HANDLE );
        (void)cy_rtos_set_mutex( &mqtt_db_mutex );
        return CY_RSLT_MODULE_MQTT_CREATE_FAIL;
    }

    result = cy_rtos_set_mutex( &mqtt_db_mutex );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_create - Released Mutex %p \n", mqtt_db_mutex );

    result = cy_mqtt_get_handle( &handle, descriptor );
    if( result == CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nDescriptor is not unique. \n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    mqtt_obj = (cy_mqtt_object_t *)malloc( sizeof( cy_mqtt_object_t ) );
    if( mqtt_obj == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMemory not available to create MQTT object..!\n" );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_obj : %p..!\n", mqtt_obj );

    /* Clear the MQTT handle data. */
    memset( mqtt_obj, 0x00, sizeof( cy_mqtt_object_t ) );

    if( security != NULL )
    {
        mqtt_obj->security.alpnprotos = security->alpnprotos;
        mqtt_obj->security.alpnprotoslen = security->alpnprotoslen;
        mqtt_obj->security.sni_host_name = security->sni_host_name;
        mqtt_obj->security.sni_host_name_size = security->sni_host_name_size;
        mqtt_obj->security.username = security->username;
        mqtt_obj->security.username_size = security->username_size;
        mqtt_obj->security.password = security->password;
        mqtt_obj->security.password_size = security->password_size;

        mqtt_obj->security.client_cert = security->client_cert;
        mqtt_obj->security.client_cert_size = security->client_cert_size;
        mqtt_obj->security.private_key = security->private_key;
        mqtt_obj->security.private_key_size = security->private_key_size;
        mqtt_obj->security.root_ca = security->root_ca;
        mqtt_obj->security.root_ca_size = security->root_ca_size;
        mqtt_obj->security.root_ca_verify_mode = security->root_ca_verify_mode;
        mqtt_obj->security.root_ca_location = security->root_ca_location;
        mqtt_obj->security.cert_key_location = security->cert_key_location;
        mqtt_obj->mqtt_secure_mode = true;
    }
    else
    {
        mqtt_obj->mqtt_secure_mode = false;
    }

    mqtt_obj->server_info.host_name = broker_info->hostname;
    mqtt_obj->server_info.port = broker_info->port;

    result = cy_rtos_init_mutex2( &(mqtt_obj->process_mutex), false );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nCreating new mutex %p. failed\n", mqtt_obj->process_mutex );
        goto exit;
    }

    process_mutex_init_status = true;

    result = mqtt_initialize_core_lib( &(mqtt_obj->mqtt_context), &(mqtt_obj->network_context), buffer, bufflen );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nmqtt_initialize_core_lib failed with Error : [0x%X] \n", (unsigned int)result );
        goto exit;
    }
    else
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nmqtt_initialize_core_lib successful.\n" );
    }

    mqtt_obj->network_context.disconnect_info.cbf = mqtt_awsport_network_disconnect_callback;
    mqtt_obj->network_context.disconnect_info.user_data = ( void * )mqtt_obj;

    mqtt_obj->network_context.receive_info.cbf = mqtt_awsport_network_receive_callback;
    mqtt_obj->network_context.receive_info.user_data = ( void * )mqtt_obj;

    result = cy_rtos_get_mutex( &mqtt_db_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        goto exit;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_create - Acquired Mutex %p \n", mqtt_db_mutex );

