Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    slot_index = 0;
    slot_found = false;

    while( slot_index < CY_MQTT_MAX_HANDLE )
    {
        if( mqtt_handle_database[slot_index].mqtt_handle == NULL )
        {
            mqtt_handle_database[slot_index].mqtt_handle = (void *)mqtt_obj;
            mqtt_handle_database[slot_index].mqtt_context = &(mqtt_obj->mqtt_context);
            slot_found = true;
            break;
        }
        slot_index++;
    }

    if( slot_found == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n Free slot not available for new handle..!\n" );
        (void)cy_rtos_set_mutex( &mqtt_db_mutex );
        result = CY_RSLT_MODULE_MQTT_CREATE_FAIL;
        goto exit;
    }

    /* Initialize timer to handle MQTT ping timeout events */
    result = cy_rtos_init_timer( &mqtt_obj->mqtt_timer, CY_TIMER_TYPE_ONCE, ( cy_timer_callback_t )mqtt_ping_request_callback, ( cy_timer_callback_arg_t )mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_init_timer failed with Error : [0x%X] \n", (unsigned int)result );
        result = cy_rtos_set_mutex( &mqtt_db_mutex );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        }
        goto exit;
    }
    result = cy_rtos_init_timer( &mqtt_obj->mqtt_ping_resp_timer, CY_TIMER_TYPE_ONCE, ( cy_timer_callback_t )mqtt_pingresp_timeout_callback, ( cy_timer_callback_arg_t )mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR,
                "\nPing Resp Timer: cy_rtos_init_timer failed with Error : [0x%X] \n", (unsigned int)result );
        result = cy_rtos_set_mutex( &mqtt_db_mutex );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR,
                    "\nPing Resp Timer: cy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        }
        goto exit;
    }
    memcpy(mqtt_obj->mqtt_descriptor, descriptor, strlen(descriptor)+1);

    mqtt_obj->mqtt_magic_header = CY_MQTT_MAGIC_HEADER;
    mqtt_obj->mqtt_magic_footer = CY_MQTT_MAGIC_FOOTER;
    mqtt_obj->mqtt_obj_index = slot_index;
    *mqtt_handle = (void *)mqtt_obj;
    mqtt_handle_count++;

    result = cy_rtos_set_mutex( &mqtt_db_mutex );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        goto exit;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_create - Released Mutex %p \n", mqtt_db_mutex );

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nMQTT object created successfully..\n" );

    return CY_RSLT_SUCCESS;

exit :
    if( mqtt_obj != NULL )
    {
        if( process_mutex_init_status == true )
        {
            (void)cy_rtos_deinit_mutex( &(mqtt_obj->process_mutex) );
            process_mutex_init_status = false;
        }
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\n Free mqtt_obj : %p..!\n", mqtt_obj );
        free( mqtt_obj );
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_connect( cy_mqtt_t mqtt_handle, cy_mqtt_connect_info_t *connect_info )
{
    cy_rslt_t                     result = CY_RSLT_SUCCESS;
    cy_rslt_t                     res = CY_RSLT_SUCCESS;
    RetryUtilsParams_t            reconnectParams;
    MQTTStatus_t                  mqttStatus = MQTTSuccess;
    RetryUtilsStatus_t            retryUtilsStatus = RetryUtilsSuccess;
    cy_mqtt_object_t              *mqtt_obj;
    bool                          create_clean_session = false;
    MQTTConnectInfo_t             connect_details;
    MQTTPublishInfo_t             will_msg_details;
    MQTTPublishInfo_t             *will_msg_ptr = NULL;
    cy_awsport_ssl_credentials_t  *security = NULL;

    if( mqtt_handle == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_connect()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_connect - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        return result;
    }

    memset( &connect_details, 0x00, sizeof( MQTTConnectInfo_t ) );
    memset( &will_msg_details, 0x00, sizeof( MQTTPublishInfo_t ) );

    /* Connect Information */
    connect_details.cleanSession = connect_info->clean_session;
    connect_details.keepAliveSeconds = connect_info->keep_alive_sec;
    connect_details.pClientIdentifier = connect_info->client_id;
    connect_details.clientIdentifierLength = connect_info->client_id_len;
    connect_details.pPassword = connect_info->password;
    connect_details.passwordLength = connect_info->password_len;
    connect_details.pUserName = connect_info->username;
    connect_details.userNameLength = connect_info->username_len;

    /* Store the keepAlivetimeout */
    mqtt_obj->keepAliveSeconds = connect_info->keep_alive_sec;

    if( connect_info->will_info != NULL )
    {
        /* Will information. */
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nWill info is not NULL ..!\n" );

        if( connect_info->will_info->qos > CY_MQTT_QOS2 )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid Will msg QoS..!\n" );
            result = CY_RSLT_MODULE_MQTT_CONNECT_FAIL;
            goto exit;
        }
        if( (connect_info->will_info->dup != true) && (connect_info->will_info->dup != false) )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid Will msg dup..!\n" );
            result = CY_RSLT_MODULE_MQTT_CONNECT_FAIL;
            goto exit;
        }
        if( (connect_info->will_info->retain != true) && (connect_info->will_info->retain != false) )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid Will msg retain..!\n" );
            result = CY_RSLT_MODULE_MQTT_CONNECT_FAIL;
            goto exit;
        }

        if( connect_info->will_info->qos == CY_MQTT_QOS0 )
        {
            will_msg_details.qos = MQTTQoS0;
        }
        else if( connect_info->will_info->qos == CY_MQTT_QOS1 )
        {
            will_msg_details.qos = MQTTQoS1;
        }
        else
        {
            will_msg_details.qos = MQTTQoS2;
        }

        will_msg_details.dup = connect_info->will_info->dup;
        will_msg_details.retain = connect_info->will_info->retain;
        will_msg_details.pTopicName = connect_info->will_info->topic;
        will_msg_details.topicNameLength = connect_info->will_info->topic_len;
        will_msg_details.pPayload = connect_info->will_info->payload;
        will_msg_details.payloadLength = connect_info->will_info->payload_len;
        will_msg_ptr = &will_msg_details;
    }
    else
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nWill info is NULL ..!\n" );
        will_msg_ptr = NULL;
    }

    /* Initialize the reconnect attempts and interval. */
    RetryUtils_ParamsReset( &reconnectParams );

    if( mqtt_obj->mqtt_secure_mode == true )
    {
        security = &(mqtt_obj->security);
    }
    else
    {
        security = NULL;
    }

    /* Attempt to connect to an MQTT broker. If connection fails, retry after
     * a timeout. The timeout value will exponentially increase until the maximum
     * attempts are reached.
     */
    do
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nCreating MQTT socket..\n" );
        result = cy_awsport_network_create( &(mqtt_obj->network_context), &(mqtt_obj->server_info), security, &(mqtt_obj->network_context.disconnect_info), &(mqtt_obj->network_context.receive_info) );
        if ( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_create failed with Error : [0x%X] \n", (unsigned int)result );
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nConnection to the broker failed. Retrying connection with backoff and jitter.\n" );
            retryUtilsStatus = RetryUtils_BackoffAndSleep( &reconnectParams );
        }
        else
        {
            /* Establish a TLS session with the MQTT broker. */
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "Establishing a TLS session to %.*s:%d.\n",
                             strlen(mqtt_obj->server_info.host_name), mqtt_obj->server_info.host_name, mqtt_obj->server_info.port );
            result = cy_awsport_network_connect( &(mqtt_obj->network_context),
                                                 CY_MQTT_MESSAGE_SEND_TIMEOUT_MS,
                                                 CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nConnection to the broker failed. Retrying connection with backoff and jitter.\n" );

                retryUtilsStatus = RetryUtils_BackoffAndSleep( &reconnectParams );
                (void)cy_awsport_network_delete( &(mqtt_obj->network_context) );
                /*
                 * In case of an unexpected network disconnection, the cy_awsport_network_delete API always returns failure. Therefore,
                 * the return value of the cy_awsport_network_delete API is not checked here.
                 */
                /* Fall-through. */
            }

            if( retryUtilsStatus == RetryUtilsRetriesExhausted )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nConnection to the broker failed, all attempts exhausted.\n" );
                result = CY_RSLT_MODULE_MQTT_CONNECT_FAIL;
            }
        }

    } while( ( result != CY_RSLT_SUCCESS ) && ( retryUtilsStatus == RetryUtilsSuccess ) );

    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nTLS connection failed with Error : [0x%X] \n", (unsigned int)result );
        goto exit;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nTLS connection established ..\n" );

