Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    create_clean_session = (connect_details.cleanSession == true ) ? true : false;
    if( create_clean_session == true )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nCreating clean session ..\n" );
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nCreating an MQTT connection to %.*s.\n",
                     strlen(mqtt_obj->server_info.host_name), mqtt_obj->server_info.host_name );

    /* Sends an MQTT Connect packet using the established TLS session. */
    result = mqtt_establish_session( mqtt_obj, &connect_details, will_msg_ptr, create_clean_session, &(mqtt_obj->broker_session_present) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nEstablish MQTT session failed with Error : [0x%X] \n", (unsigned int)result );
        goto exit;
    }
    else
    {

        if( (mqtt_obj->broker_session_present == true) && (create_clean_session == false) )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nMQTT session with broker is re-established. Resending unacked publishes.\n" );
            /* Handle all resend of PUBLISH messages. */
            result = mqtt_handle_publish_resend( mqtt_obj );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nHandle all the resend of PUBLISH messages failed with Error : [0x%X] \n", (unsigned int)result );
                goto exit;
            }
        }
        else
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\n A clean MQTT connection is established. Cleaning up all the stored outgoing publishes.\n" );

            /* Clean up the outgoing PUBLISH packets and wait for ack because this new
             * connection does not re-establish an existing session. */
            result = mqtt_cleanup_outgoing_publishes( mqtt_obj );
            if( result != CY_RSLT_SUCCESS )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nCleaning of PUBLISH messages failed with Error : [0x%X] \n", (unsigned int)result );
                goto exit;
            }
        }
    }

    mqtt_obj->mqtt_conn_status = true;

    result = start_timer( mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed with Error : [0x%X] \n", (unsigned int)result );
        goto exit;
    }

    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
        goto exit;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_connect - Released Mutex %p \n", mqtt_obj->process_mutex );

    return result;

exit :
    if( mqtt_obj->mqtt_session_established == true )
    {
        mqttStatus = MQTT_Disconnect( &(mqtt_obj->mqtt_context) );
        if( mqttStatus != MQTTSuccess )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Sending MQTT DISCONNECT failed with status=%s.\n",
                             MQTT_Status_strerror( mqttStatus ) );
            /*
             * In case of an unexpected network disconnection, the MQTT_Disconnect API always returns failure. Therefore,
             * the return value of the MQTT_Disconnect API is not checked here.
             */
            /* Fall-through. */
        }
        mqtt_obj->mqtt_session_established = false;
    }

    res = cy_awsport_network_disconnect( &(mqtt_obj->network_context) );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_disconnect failed with Error : [0x%X] \n", (unsigned int)result );
        /*
         * In case of an unexpected network disconnection, the cy_awsport_network_disconnect API always returns failure. Therefore,
         * the return value of the cy_awsport_network_disconnect API is not checked here.
         */
        /* Fall-through. */
    }
    res = cy_awsport_network_delete( &(mqtt_obj->network_context) );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_delete failed with Error : [0x%X] \n", (unsigned int)result );
        /*
         * In case of an unexpected network disconnection, the cy_awsport_network_delete API always returns failure. Therefore,
         * the return value of the cy_awsport_network_delete API is not checked here.
         */
        /* Fall-through. */
    }

    res = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( res != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)res );
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_connect - Released Mutex %p \n", mqtt_obj->process_mutex );

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_publish( cy_mqtt_t mqtt_handle, cy_mqtt_publish_info_t *pubmsg )
{
    cy_rslt_t        result = CY_RSLT_SUCCESS;
    cy_rslt_t        timer_result = CY_RSLT_SUCCESS;
    MQTTStatus_t     mqttStatus = MQTTSuccess;
    uint8_t          publishIndex = CY_MQTT_MAX_OUTGOING_PUBLISHES;
    cy_mqtt_object_t *mqtt_obj;
    uint8_t          retry = 0;
    uint32_t         timeout = 0;

    if( (mqtt_handle == NULL) || (pubmsg == NULL) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_publish()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

