Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    if( mqtt_obj->mqtt_session_established == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT client session not present..!\n" );
        return CY_RSLT_MODULE_MQTT_NOT_CONNECTED;
    }

    /* Get the next free index for the outgoing PUBLISH packets. All QoS2 outgoing
     * PUBLISH packets are stored until a PUBREC is received. These messages are
     * stored for supporting a resend if a network connection is broken before
     * receiving a PUBREC. */
    result = mqtt_get_next_free_index_for_publish( mqtt_obj, &publishIndex );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nUnable to find a free spot for outgoing PUBLISH message.\n" );
        return CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
    }
    else
    {
        if( (pubmsg->qos == CY_MQTT_QOS0) || (pubmsg->qos == CY_MQTT_QOS1) || (pubmsg->qos == CY_MQTT_QOS2) )
        {
            mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.qos = (MQTTQoS_t)pubmsg->qos;
        }
        else
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nQoS level not supported..!\n" );
            return CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
        }
        mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.pTopicName = pubmsg->topic;
        mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.topicNameLength = pubmsg->topic_len;
        mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.pPayload = pubmsg->payload;
        mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.payloadLength = pubmsg->payload_len;

        result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
            return result;
        }
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_publish - Acquired Mutex %p \n", mqtt_obj->process_mutex );

        /* Get a new packet ID. */
        mqtt_obj->pub_ack_status.packetid = mqtt_obj->outgoing_pub_packets[ publishIndex ].packetid;

        /* Stop MQTT Ping Timer */
        result = stop_timer( mqtt_obj );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nstop_timer failed\n" );
        }

        /* Publish retry loop. */
        do
        {
            mqtt_obj->pub_ack_status.puback_status = false;
            timeout = CY_MQTT_ACK_RECEIVE_TIMEOUT_MS;

            /* Send the PUBLISH packet. */
            mqttStatus = MQTT_Publish( &(mqtt_obj->mqtt_context),
                                       &(mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo),
                                       mqtt_obj->outgoing_pub_packets[ publishIndex ].packetid );
            if( mqttStatus != MQTTSuccess )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to send PUBLISH packet to broker with error = %s.\n",
                                 MQTT_Status_strerror( mqttStatus ) );
                result = CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
            }
            else
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nPUBLISH sent for topic %.*s to broker with packet ID %u.\n",
                                 pubmsg->topic_len, pubmsg->topic, mqtt_obj->outgoing_pub_packets[ publishIndex ].packetid );
                /* Process the incoming packet from the broker.
                 * Acknowledgment for PUBLISH ( PUBACK ) will be received here. */
                if( mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.qos != MQTTQoS0 )
                {
                    do
                    {
                        mqttStatus = MQTT_ProcessLoop( &(mqtt_obj->mqtt_context), CY_MQTT_RECEIVE_DATA_TIMEOUT_MS );
                        if( (mqttStatus != MQTTSuccess) && (mqttStatus != MQTTNoDataAvailable) )
                        {
                            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT_ProcessLoop returned with status = %s.\n", MQTT_Status_strerror( mqttStatus ) );
                            result = CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
                            break;
                        }
                        else
                        {
                            if( mqtt_obj->pub_ack_status.puback_status == true )
                            {
                                result = CY_RSLT_SUCCESS;
                                break;
                            }
                        }

                        timeout = timeout - CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS;

                    } while( timeout > 0 );

                    /* Assign the MQTT Status to an error in case of PUBACK/PUBREC receive failure to retry publish. */
                    if( mqtt_obj->pub_ack_status.puback_status == false )
                    {
                        result = CY_RSLT_MODULE_MQTT_PUBLISH_FAIL;
                        mqttStatus = MQTTRecvFailed;
                    }
                }
                else
                {
                    result = CY_RSLT_SUCCESS;
                }
                mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.dup = true;
            }
            retry++;
        } while( (mqttStatus != MQTTSuccess) && (retry < CY_MQTT_MAX_RETRY_VALUE) );

        /* Start MQTT Ping Timer */
        timer_result = start_timer( mqtt_obj );
        if( timer_result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed with Error : [0x%X] \n", (unsigned int)timer_result );
            mqtt_cleanup_outgoing_publish( mqtt_obj, publishIndex );
            (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
            return timer_result;
        }

        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nFailed to send PUBLISH packet to broker with max retry..!\n " );
            mqtt_cleanup_outgoing_publish( mqtt_obj, publishIndex );
            (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
            return result;
        }

        if( mqtt_obj->outgoing_pub_packets[ publishIndex ].pubinfo.qos == MQTTQoS0 )
        {
            /* Clean up outgoing_pub_packets for QoS0 PUBLISH packets.*/
            (void)mqtt_cleanup_outgoing_publish( mqtt_obj, publishIndex );
        }

        result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
            return result;
        }
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_publish - Released Mutex %p \n", mqtt_obj->process_mutex );
    }

    return result;
}

