Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_subscribe( cy_mqtt_t mqtt_handle, cy_mqtt_subscribe_info_t *sub_info, uint8_t sub_count  )
{
    cy_rslt_t              result = CY_RSLT_SUCCESS;
    cy_rslt_t              timer_result = CY_RSLT_SUCCESS;
    MQTTStatus_t           mqttStatus;
    cy_mqtt_object_t       *mqtt_obj;
    uint8_t                index = 0, retry = 0;
    MQTTSubscribeInfo_t    *sub_list = NULL;
    uint32_t               timeout = 0;

    if( (mqtt_handle == NULL) || (sub_info == NULL) || (sub_count < 1) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_subscribe()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    if( mqtt_obj->mqtt_session_established == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT client session not present..!\n" );
        return CY_RSLT_MODULE_MQTT_NOT_CONNECTED;
    }

    if( sub_count > CY_MQTT_MAX_OUTGOING_SUBSCRIBES )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMax number of supported subscription count in single request is %d\n", (int)CY_MQTT_MAX_OUTGOING_SUBSCRIBES );
        return CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
    }

    sub_list = (MQTTSubscribeInfo_t *)malloc( (sizeof(MQTTSubscribeInfo_t) * sub_count) );
    if( sub_list == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMemory not available to create sub_list..!\n" );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nsub_list : %p..!\n", sub_list );

    for( index = 0;index < sub_count;index++ )
    {
        if( sub_info[index].qos == CY_MQTT_QOS0 )
        {
            sub_list[ index ].qos = MQTTQoS0;
        }
        else if( sub_info[index].qos == CY_MQTT_QOS1 )
        {
            sub_list[ index ].qos = MQTTQoS1;
        }
        else if( sub_info[index].qos == CY_MQTT_QOS2 )
        {
            sub_list[ index ].qos = MQTTQoS2;
        }
        else
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nQoS not supported..!\n" );
            free( sub_list );
            return CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
        }
        sub_info[ index ].allocated_qos = CY_MQTT_QOS_INVALID;
        sub_list[ index ].pTopicFilter = sub_info[index].topic;
        sub_list[ index ].topicFilterLength = sub_info[index].topic_len;
    }

    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        free( sub_list );
        return result;
    }

    /* Generate the packet identifier for the SUBSCRIBE packet. */
    mqtt_obj->sent_packet_id = MQTT_GetPacketId( &(mqtt_obj->mqtt_context) );
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_subscribe - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    /* Stop MQTT Ping Timer */
    result = stop_timer( mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nstop_timer failed\n" );
    }

    do
    {
        timeout = CY_MQTT_ACK_RECEIVE_TIMEOUT_MS;
        result = CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
        memset( &mqtt_obj->sub_ack_status, 0x00, sizeof(mqtt_obj->sub_ack_status) );

        /*
         * num_of_subs_in_req is initialized with number of subscribe messages in one MQTT subscribe request.
         * Once after receiving the subscription acknowledgment this variable is set to zero.
         * So num_of_subs_in_req == 0 refers that there is no outstanding subscription messages waiting for acknowledgment. */
        mqtt_obj->num_of_subs_in_req = sub_count;

        /* Send the SUBSCRIBE packet. */
        mqttStatus = MQTT_Subscribe( &(mqtt_obj->mqtt_context),
                                     sub_list,
                                     sub_count,
                                     mqtt_obj->sent_packet_id );
        if( mqttStatus != MQTTSuccess )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nFailed to send SUBSCRIBE packet to broker with error = %s.\n",
                             MQTT_Status_strerror( mqttStatus ) );
            result = CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
        }
        else
        {
            for( index = 0; index < sub_count; index++ )
            {
                mqtt_obj->sub_ack_status[index] = MQTTSubAckFailure;
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nSUBSCRIBE sent for topic %.*s to broker.\n",
                                 sub_list[ index ].topicFilterLength,
                                 sub_list[ index ].pTopicFilter );
            }
            do
            {
                /* Process the incoming packet from the broker.
                 * Acknowledgment for subscription ( SUBACK ) will be received here. */
                mqttStatus = MQTT_ProcessLoop( &(mqtt_obj->mqtt_context), CY_MQTT_RECEIVE_DATA_TIMEOUT_MS );
                if( mqttStatus != MQTTSuccess )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT_ProcessLoop returned with status = %s.\n", MQTT_Status_strerror( mqttStatus ) );
                    result = CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
                    break;
                }

