Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
                /* if suback status is updated then num_of_subs_in_req will be set to 0 in mqtt_event_callback.*/
                if( mqtt_obj->num_of_subs_in_req == 0 )
                {
                    result = CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL; /* Initialize result with failure. */
                    for( index = 0; index < sub_count; index++ )
                    {
                        if( mqtt_obj->sub_ack_status[index] == MQTTSubAckFailure )
                        {
                            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nMQTT broker rejected SUBSCRIBE request for topic %.*s .\n",
                                             sub_list[ index ].topicFilterLength,
                                             sub_list[ index ].pTopicFilter );
                            sub_info[ index ].allocated_qos = CY_MQTT_QOS_INVALID;
                        }
                        else
                        {
                            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nSUBSCRIBE accepted for topic %.*s with QoS %d .\n",
                                             sub_list[ index ].topicFilterLength,
                                             sub_list[ index ].pTopicFilter, mqtt_obj->sub_ack_status[index] );
                            if( mqtt_obj->sub_ack_status[index] == MQTTSubAckSuccessQos0 )
                            {
                                sub_info[ index ].allocated_qos = CY_MQTT_QOS0;
                            }
                            else if( mqtt_obj->sub_ack_status[index] == MQTTSubAckSuccessQos1 )
                            {
                                sub_info[ index ].allocated_qos = CY_MQTT_QOS1;
                            }
                            else
                            {
                                sub_info[ index ].allocated_qos = CY_MQTT_QOS2;
                            }
                            result = CY_RSLT_SUCCESS; /* Update with success if at least one subscription is successful. */
                        }
                    }
                    break; /* Received the ack. So exit timeout do loop */
                }
                timeout = timeout - CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS;
            } while( timeout > 0 );

            if( mqtt_obj->num_of_subs_in_req != 0 )
            {
                result = CY_RSLT_MODULE_MQTT_SUBSCRIBE_FAIL;
                mqttStatus = MQTTRecvFailed; /* Assign error value to retry subscribe. */
            }
        }
        retry++;
    } while( (mqttStatus != MQTTSuccess) && (retry < CY_MQTT_MAX_RETRY_VALUE) );

    /* Start MQTT Ping Timer */
    timer_result = start_timer( mqtt_obj );
    if( timer_result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed with Error : [0x%X] \n", (unsigned int)timer_result );
        goto exit;
    }

    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nSubscription ack status is MQTTSubAckFailure..!\n" );
        goto exit;
    }

    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
        free( sub_list );
        return result;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_subscribe - Released Mutex %p \n", mqtt_obj->process_mutex );
    free( sub_list );
    return CY_RSLT_SUCCESS;

exit :
    (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    /* Free sub_list */
    if( sub_list != NULL )
    {
        free( sub_list );
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_unsubscribe( cy_mqtt_t mqtt_handle, cy_mqtt_unsubscribe_info_t *unsub_info, uint8_t unsub_count )
{
    cy_rslt_t              result = CY_RSLT_SUCCESS;
    cy_rslt_t              timer_result = CY_RSLT_SUCCESS;
    cy_mqtt_object_t       *mqtt_obj;
    MQTTStatus_t           mqttStatus;
    uint8_t                index = 0, retry = 0;
    MQTTSubscribeInfo_t    *unsub_list = NULL;
    uint32_t               timeout = 0;

    if( (mqtt_handle == NULL) || (unsub_info == NULL) || (unsub_count < 1) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_unsubscribe()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    if( mqtt_obj->mqtt_session_established == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT client session not present..!\n" );
        return CY_RSLT_MODULE_MQTT_NOT_CONNECTED;
    }

    if( unsub_count > CY_MQTT_MAX_OUTGOING_SUBSCRIBES )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMax number of supported unsubscription count in single request is %d\n", (int)CY_MQTT_MAX_OUTGOING_SUBSCRIBES );
        return CY_RSLT_MODULE_MQTT_UNSUBSCRIBE_FAIL;
    }

    unsub_list = (MQTTSubscribeInfo_t *)malloc( (sizeof(MQTTSubscribeInfo_t) * unsub_count) );
    if( unsub_list == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMemory not available to create unsub_list..!\n" );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nsub_list : %p..!\n", unsub_list );

    for( index = 0; index < unsub_count; index++ )
    {
        if( unsub_info[index].qos == CY_MQTT_QOS0 )
        {
            unsub_list[ index ].qos = MQTTQoS0;
        }
        else if( unsub_info[index].qos == CY_MQTT_QOS1 )
        {
            unsub_list[ index ].qos = MQTTQoS1;
        }
        else if( unsub_info[index].qos == CY_MQTT_QOS2 )
        {
            unsub_list[ index ].qos = MQTTQoS2;
        }
        else
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nQoS level not supported...\n" );
            free( unsub_list );
            return CY_RSLT_MODULE_MQTT_UNSUBSCRIBE_FAIL;
        }
        unsub_list[ index ].pTopicFilter = unsub_info[index].topic;
        unsub_list[ index ].topicFilterLength = unsub_info[index].topic_len;
    }

