Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        free( unsub_list );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_unsubscribe - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    /* Generate the packet identifier for the UNSUBSCRIBE packet. */
    mqtt_obj->sent_packet_id = MQTT_GetPacketId( &(mqtt_obj->mqtt_context) );

    /* Stop MQTT Ping Timer */
    result = stop_timer( mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nstop_timer failed" );
    }

    do
    {
        timeout = CY_MQTT_ACK_RECEIVE_TIMEOUT_MS;
        mqtt_obj->unsub_ack_received = false;
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "UNSUBSCRIBE sent for topic %.*s to broker.\n\n", unsub_info->topic_len, unsub_info->topic );
        /* Send the UNSUBSCRIBE packet. */
        mqttStatus = MQTT_Unsubscribe( &(mqtt_obj->mqtt_context),
                                       unsub_list,
                                       unsub_count,
                                       mqtt_obj->sent_packet_id );
        if( mqttStatus != MQTTSuccess )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to send UNSUBSCRIBE packet to broker with error = %s.\n",
                        MQTT_Status_strerror( mqttStatus ) );
            result = CY_RSLT_MODULE_MQTT_UNSUBSCRIBE_FAIL;
        }
        else
        {
            do
            {
                /* Process the  incoming packet from the broker.
                 * Acknowledgment for UNSUBSCRIBE ( UNSUBACK ) will be received here. */
                mqttStatus = MQTT_ProcessLoop( &(mqtt_obj->mqtt_context), CY_MQTT_RECEIVE_DATA_TIMEOUT_MS );
                if( mqttStatus != MQTTSuccess )
                {
                    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT_ProcessLoop returned with status = %s.\n", MQTT_Status_strerror( mqttStatus ) );
                    result = CY_RSLT_MODULE_MQTT_UNSUBSCRIBE_FAIL;
                    break;
                }
                if( mqtt_obj->unsub_ack_received == true )
                {
                    result = CY_RSLT_SUCCESS;
                    break;
                }
                timeout = timeout - CY_MQTT_SOCKET_RECEIVE_TIMEOUT_MS;
            } while( timeout > 0 );

            if( mqtt_obj->unsub_ack_received == false )
            {
                cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nNot received unsuback before timeout %u millisecond \n", (unsigned int)CY_MQTT_ACK_RECEIVE_TIMEOUT_MS );
                result = CY_RSLT_MODULE_MQTT_UNSUBSCRIBE_FAIL;
                mqttStatus = MQTTRecvFailed; /* Assign error value to retry subscribe. */
            }
        }
        retry++;
    } while( (mqttStatus != MQTTSuccess) && (retry < CY_MQTT_MAX_RETRY_VALUE) );

    /* Start MQTT Ping Timer */
    timer_result = start_timer( mqtt_obj );
    if( timer_result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nstart_timer failed with Error : [0x%X] \n", (unsigned int)timer_result );
        goto exit;
    }

    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nSubscription ack status is MQTTSubAckFailure..!\n" );
        goto exit;
    }

    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
        free( unsub_list );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_unsubscribe - Released Mutex %p \n", mqtt_obj->process_mutex );

    /* Free unsub_list. */
    free( unsub_list );
    return CY_RSLT_SUCCESS;

exit :
    (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    /* Free unsub_list. */
    if( unsub_list != NULL )
    {
        free( unsub_list );
    }

    return result;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_disconnect( cy_mqtt_t mqtt_handle )
{
    cy_rslt_t         result = CY_RSLT_SUCCESS;
    cy_mqtt_object_t  *mqtt_obj;
    MQTTStatus_t      mqttStatus = MQTTSuccess;

    if( mqtt_handle == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_disconnect()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_disconnect - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_disconnect - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    result = stop_timer( mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_rtos_stop_timer failed\n" );
    }

    result = stop_mqtt_ping_resp_timer( mqtt_obj );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nfailed to stop mqtt ping response timer\n" );
    }

    if( mqtt_obj->mqtt_conn_status == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nMQTT client not connected..!\n" );
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_disconnect - Releasing Mutex %p \n", mqtt_obj->process_mutex );
        result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
            return result;
        }
        return CY_RSLT_MODULE_MQTT_NOT_CONNECTED;
    }

    /* Send DISCONNECT. */
    mqttStatus = MQTT_Disconnect( &(mqtt_obj->mqtt_context) );
    if( mqttStatus != MQTTSuccess )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "Sending MQTT DISCONNECT failed with status=%s.\n",
                         MQTT_Status_strerror( mqttStatus ) );
        /*
         * In case of an unexpected network disconnection, the MQTT_Disconnect API always returns failure. Therefore,
         * the return value of the MQTT_Disconnect API is not checked here.
         */
        /* Fall-through. */
    }

    mqtt_obj->mqtt_session_established = false;
    result = cy_awsport_network_disconnect( &(mqtt_obj->network_context) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_disconnect failed with Error : [0x%X] \n", (unsigned int)result );
        /*
         * In case of an unexpected network disconnection, the cy_awsport_network_disconnect API always returns failure. Therefore,
         * the return value of the cy_awsport_network_disconnect API is not checked here.
         */
        /* Fall-through. */
    }

