Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    if( mqtt_handle_count != 0 )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nMQTT library is deinit cannot be done. Number of MQTT client instance : [%d] \n", mqtt_handle_count );
        return result;
    }

    result = cy_awsport_network_deinit();
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_awsport_network_deinit failed with Error : [0x%X] \n", (unsigned int)result );
        return result;
    }
    else
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_awsport_network_deinit successful.\n" );
    }

    if( mqtt_event_process_thread != NULL )
    {
        event.socket_event = CY_MQTT_SOCKET_EVENT_EXIT_THREAD;
        event.mqtt_obj = NULL;
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nPushing event to terminate mqtt_event_processing_thread \n" );

        result = cy_rtos_put_queue( &mqtt_event_queue, (void *)&event, CY_MQTT_EVENT_QUEUE_TIMEOUT_IN_MSEC, false );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nPushing event to terminate mqtt_event_processing_thread failed with Error : [0x%X] \n", (unsigned int)result );
        }

        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\nJoining MQTT event process thread %p..!\n", mqtt_event_process_thread );
        result = cy_rtos_join_thread( &mqtt_event_process_thread );
        if( result != CY_RSLT_SUCCESS )
        {
            cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nJoin MQTT event process thread failed with Error : [0x%X] \n", (unsigned int)result );
            return result;
        }
        mqtt_event_process_thread = NULL;
    }

    result = cy_rtos_deinit_mutex( &mqtt_db_mutex );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_deinit_mutex failed with Error : [0x%X] \n", (unsigned int)result );
        return result;
    }

    mqtt_db_mutex_init_status = false;

    result = cy_rtos_deinit_queue( &mqtt_event_queue );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_deinit_queue failed with Error : [0x%X] \n", (unsigned int)result );
        return result;
    }
    else
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_rtos_deinit_queue successful.\n" );
    }

    mqtt_lib_init_status = false;
    return CY_RSLT_SUCCESS;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_register_event_callback( cy_mqtt_t mqtt_handle,
                                           cy_mqtt_callback_t event_callback,
                                           void *user_data )
{
    cy_rslt_t         result    = CY_RSLT_SUCCESS;
    cy_mqtt_object_t  *mqtt_obj = NULL;
    int i = 0;

    if( mqtt_handle == NULL || event_callback == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_register_event_callback()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( user_data == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_INFO, "\nArgument user_data is NULL..!\n" );
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_register_event_callback - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_register_event_callback - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    for ( i = 0; i < CY_MQTT_MAX_EVENT_CALLBACKS; i++ )
    {
        if ( mqtt_obj->mqtt_event_cb[i] == NULL )
        {
            mqtt_obj->mqtt_event_cb[i] = event_callback;
            mqtt_obj->user_data[i] = user_data;
            break;
        }
    }
    if( i == CY_MQTT_MAX_EVENT_CALLBACKS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Maximum number of callbacks already registered! \r\n");
        (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_register_event_callback - Releasing Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_register_event_callback - Released Mutex %p \n", mqtt_obj->process_mutex );

    return CY_RSLT_SUCCESS;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_deregister_event_callback( cy_mqtt_t mqtt_handle,
                                             cy_mqtt_callback_t event_callback)
{
    cy_rslt_t         result    = CY_RSLT_SUCCESS;
    cy_mqtt_object_t  *mqtt_obj = NULL;
    int i = 0;

    if( mqtt_handle == NULL || event_callback == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_deregister_event_callback()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    if( (mqtt_lib_init_status == false) || (mqtt_db_mutex_init_status == false) )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nLibrary init is not done/Global mutex is not initialized..!\n " );
        return CY_RSLT_MODULE_MQTT_NOT_INITIALIZED;
    }

    mqtt_obj = (cy_mqtt_object_t *)mqtt_handle;

