Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/mqtt/source/cy_mqtt_api.c
    if( is_mqtt_obj_valid( mqtt_obj ) == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nInvalid MQTT handle..!\n" );
        return CY_RSLT_MODULE_MQTT_INVALID_HANDLE;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_deregister_event_callback - Acquiring Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_get_mutex( &(mqtt_obj->process_mutex), CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_obj->process_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_deregister_event_callback - Acquired Mutex %p \n", mqtt_obj->process_mutex );

    for ( i = 0; i < CY_MQTT_MAX_EVENT_CALLBACKS; i++ )
    {
        if ( mqtt_obj->mqtt_event_cb[i] == event_callback )
        {
            mqtt_obj->mqtt_event_cb[i] = NULL;
            mqtt_obj->user_data[i] = NULL;
            break;
        }
    }
    if( i == CY_MQTT_MAX_EVENT_CALLBACKS )
    {
        cy_mqtt_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Event callback not found! \r\n");
        (void)cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
        return CY_RSLT_MODULE_MQTT_NOMEM;
    }

    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_deregister_event_callback - Releasing Mutex %p \n", mqtt_obj->process_mutex );
    result = cy_rtos_set_mutex( &(mqtt_obj->process_mutex) );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_deregister_event_callback - Released Mutex %p \n", mqtt_obj->process_mutex );

    return CY_RSLT_SUCCESS;
}

/*----------------------------------------------------------------------------------------------------------*/

cy_rslt_t cy_mqtt_get_handle( cy_mqtt_t *mqtt_handle, char *descriptor )
{
    cy_rslt_t result;
    int handle_index = 0;
    bool handle_found = false;
    cy_mqtt_object_t  *mqtt_obj = NULL;

    if( mqtt_handle == NULL || descriptor == NULL )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\nBad arguments to cy_mqtt_get_handle()..!\n" );
        return CY_RSLT_MODULE_MQTT_BADARG;
    }

    result = cy_rtos_get_mutex( &mqtt_db_mutex, CY_RTOS_NEVER_TIMEOUT );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_get_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_get_handle - Acquired Mutex %p \n", mqtt_db_mutex );

    while( handle_index < mqtt_handle_count )
    {
        mqtt_obj = (cy_mqtt_object_t*)mqtt_handle_database[handle_index].mqtt_handle;
        if( mqtt_obj != NULL )
        {
            if( strcmp(mqtt_obj->mqtt_descriptor, descriptor) == 0 )
            {
                *mqtt_handle = (void*)mqtt_obj;
                handle_found = true;
                break;
            }
        }
        handle_index++;
    }

    if( handle_found == false )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\n MQTT handle for descriptor: %s not found..!\n", descriptor );
        (void)cy_rtos_set_mutex( &mqtt_db_mutex );
        return CY_RSLT_MODULE_MQTT_HANDLE_NOT_FOUND;
    }

    result = cy_rtos_set_mutex( &mqtt_db_mutex );
    if( result != CY_RSLT_SUCCESS )
    {
        cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "\ncy_rtos_set_mutex for Mutex %p failed with Error : [0x%X] \n", mqtt_db_mutex, (unsigned int)result );
        return result;
    }
    cy_mqtt_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\ncy_mqtt_get_handle - Released Mutex %p \n", mqtt_db_mutex );

    return CY_RSLT_SUCCESS;
}

#endif
